import { defineConfig } from 'vitepress'

// https://vitepress.dev/reference/site-config
export default defineConfig({
  title: "My Awesome Project",
  description: "A VitePress Site",
  themeConfig: {
    // https://vitepress.dev/reference/default-theme-config
    nav: [
      { text: 'Home', link: '/' },
      { text: 'Examples', link: '/markdown-examples' }
    ],

    sidebar: [
      {
        text: '阅读：如何高效掌握并提分',
        items: [
          { text: '学习秘籍', link: '/0.0阅读如何高效提分' },
          { text: 'Markdown Examples', link: '/markdown-examples' }
        ]
      },
      {
        text: '专题0 化学基础知识',
        items: [
          {
            text: '第一章：九年级化学',
            collapsed: true,
            items: [
              {
                text: '第1节 溶液',
                link: '/0.1.1溶液'
              },
              {
                text: '第2节 酸碱盐',
                link: '/0.1.2酸碱盐'
              }
            ]
          },
          {
            text: '第二章：化学基础概念',
            collapsed: true,
            items: [
              {
                text: '第1节 化学用语',
                link: '/0.2.1化学用语'
              },
              {
                text: '第2节 物质的分类',
                link: '/0.2.2物质的分类'
              },
              {
                text: '第3节 物质的转化',
                link: '/0.2.3物质的转化'
              }
            ]
          },
          {
            text: '第三章：物质的量',
            collapsed: true,
            items: [
              {
                text: '第1节 物质的量',
                link: '/0.3.1物质的量'
              },
              {
                text: '第2节 气体体积与阿伏伽德罗定律',
                link: '/0.3.2气体体积与阿伏伽德罗定律'
              },
              {
                text: '第3节 溶液浓度与溶液配制',
                link: '/0.3.3溶液浓度与溶液配制'
              },
              {
                text: '第4节 一些计算方法',
                link: '/0.3.4一些计算方法'
              }
            ]
          },
          {
            text: '第四章：STSE、材料、俗称用途、保存',
            collapsed: true,
            items: [
              {
                text: '第1节 物质的俗称和用途',
                link: '/0.4.1物质的俗称和用途'
              },
              {
                text: '第2节 物质的保存',
                link: '/0.4.2物质的保存'
              },
              {
                text: '第3节 化学材料',
                link: '/0.4.3化学材料'
              },
              {
                text: '第4节 STSE',
                link: '/0.4.4STSE'
              }
            ]
          },
          {
            text: '第五章：颜色/气味/溶解性',
            collapsed: true,
            items: [
              {
                text: '第1节 颜色/气味/溶解性',
                link: '/0.5.1物质的颜色'
              }
            ]
          }
        ]
      },
      {
        text: '专题1. 非金属元素',
        items:
          [
            {
              text: '第一章：氢和稀有气体',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 氢',
                    link: '/1.1.1氢'
                  },
                  {
                    text: '第2节 稀有气体',
                    link: '/1.1.2稀有气体'
                  }
                ]
            },
            {
              text: '第二章：碳族元素',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碳族元素',
                    link: '/1.2.1碳'
                  }
                ]
            },
            {
              text: '第三章：氮族元素',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碱金属和碱土金属',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第四章：氧族元素',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碱金属和碱土金属',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第五章：卤族元素',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碱金属和碱土金属',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            }
          ]
      },
      {
        text: '专题2. 金属元素',
        items:
          [
            {
              text: '第一章：碱金属',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 氢和稀有气体',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第二章：碱土金属',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碱金属和碱土金属',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第三章：硼（铝）族元素',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碱金属和碱土金属',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第四章：铁元素',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碱金属和碱土金属',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第五章：铜元素',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碱金属和碱土金属',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第六章：其它过渡金属元素',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 碱金属和碱土金属',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            }
          ]
      },
      {
        text: '专题2. 有机化学基础',
        items:
          [
            {
              text: '第一章：有机物类别和官能团',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 烷烃',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 烯烃炔烃与碳碳双键、叁键',
                    link: '/3.1.2卤代烃'
                  },
                  {
                    text: '第3节 苯和苯的同系物',
                    link: '/3.1.3羟基'
                  },
                  {
                    text: '第4节 卤代烃与碳卤键',
                    link: '/3.1.4酚羟基'
                  },
                  {
                    text: '第5节 醇与羟基',
                    link: '/3.1.5醚键'
                  },
                  {
                    text: '第6节 醚与醚键',
                    link: '/3.1.6醛基'
                  },
                  {
                    text: '第7节 酚与酚羟基',
                    link: '/3.1.7羰基'
                  },
                  {
                    text: '第8节 醛和醛基、酮与羰基',
                    link: '/3.1.8羧基'
                  },
                  {
                    text: '第9节 羧酸与羧基',
                    link: '/3.1.9酯基'
                  },
                  {
                    text: '第10节 酯与酯基',
                    link: '/3.1.10酰胺基'
                  },
                  {
                    text: '第11节 胺和酰胺',
                    link: '/3.1.11氨基'
                  }
                ]
            },
            {
              text: '第二章：生命中几种营养物质',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 糖类',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 酯类',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 蛋白质与氨基酸',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第4节 核酸',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                ]
            },
            {
              text: '第三章：性质归纳',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 能消耗H<sub>2</sub>的',
                    link: '/3.2.1能消耗氢气的'
                  },
                  {
                    text: '第2节 能使KMnO<sub>4</sub>褪色的',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  },
                  {
                    text: '第3节 能消耗NaOH的',
                    link: '/3.2.3能消耗NaOH的'
                  },
                  {
                    text: '第4节 能消耗NaHCO<sub>3</sub>的',
                    link: '/3.2.4能消耗NaHCO3的'
                  },
                  {
                    text: '第5节 能消耗Na<sub>2</sub>CO<sub>3</sub>的',
                    link: '/3.2.5能消耗Na2CO3的'
                  },
                  {
                    text: '第6节 能水解的',
                    link: '/3.2.6能水解的'
                  }
                ]
            },
            {
              text: '第四章：有机物命名',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 习惯命名法',
                    link: '/3.2.1能消耗氢气的'
                  },
                  {
                    text: '第2节 系统命名法',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  },
                  {
                    text: '第3节 含苯环的有机物命名',
                    link: '/3.2.3能消耗NaOH的'
                  },
                ]
            },
            {
              text: '第五章：判断有机反应类型',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 取代反应',
                    link: '/3.2.1能消耗氢气的'
                  },
                  {
                    text: '第2节 加成反应',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  },
                  {
                    text: '第3节 消去反应',
                    link: '/3.2.3能消耗NaOH的'
                  },
                  {
                    text: '第4节 加聚反应',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  },
                  {
                    text: '第5节 缩聚反应',
                    link: '/3.2.3能消耗NaOH的'
                  },
                  {
                    text: '第6节 氧化反应',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  },
                  {
                    text: '第7节 还原反应',
                    link: '/3.2.3能消耗NaOH的'
                  }
                ]
            },
            {
              text: '第六章：有机高频考点',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 化学仪器',
                    link: '/3.2.1能消耗氢气的'
                  },
                  {
                    text: '第2节 等效氢',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  },
                  {
                    text: '第3节 同分异构体',
                    link: '/3.2.1能消耗氢气的'
                  },
                  {
                    text: '第4节 手性碳原子与对映异构',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  },
                  {
                    text: '第5节 顺反异构',
                    link: '/3.2.1能消耗氢气的'
                  },
                  {
                    text: '第6节 共线共面问题',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  },
                  {
                    text: '第7节 吸电子基和推电子基',
                    link: '/3.2.2能使高锰酸钾褪色的'
                  }
                ]
            },
            {
              text: '第七章：官能团引入和碳链延长',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 官能团的引入',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 碳链的延长',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                ]
            },
            {
              text: '第八章：有机选择题专项',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 简单模式',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 困难模式',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                ]
            },
            {
              text: '第九章：有机合成题专项',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 简单模式',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 困难模式',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                ]
            }

          ]
      },
      {
        text: '专题3. 化学反应原理',
        items:
          [
            {
              text: '第一章：化学反应中的热效应',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 反应热',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 热化学方程式',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 反应热的测量',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第4节 反应热的与盖斯定律',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第5节 反应热与键能、物质能量',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第6节 反应热与活化能',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第7节 燃烧热、热值、摩尔生成焓',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第8节 能量变化图像题',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第二章：化学能与电能',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 简单原电池',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 生活中的化学电源',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 燃料电池',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第4节 锂离子电池',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第5节 其它电池',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第6节 电解池',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第7节 电解池的应用',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第8节 金属的腐蚀',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第9节 金属的防护',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第10节 陌生电极方程式的书写',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第三章：化学反应速率与平衡',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 化学反应速率',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 影响反应速率的因素',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 化学平衡状态',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第4节 化学平衡常数',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第5节 压强平衡常数',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第6节 影响平衡移动的因素',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第7节 等效平衡与转化率',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第8节 化学反应的方向',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第9节 化学反应的调控',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第四章：溶液中的离子平衡',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 弱电解质的电离平衡',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 电离平衡常数与电离度',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 水的电离和离子积常数',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第4节 溶液的酸碱性与pH',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第5节 酸碱中和滴定',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第6节 盐类的水解',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第7节 三大守恒',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第8节 离子浓度大小比较',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第9节 沉淀溶解平衡',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第10节 沉淀溶解平衡的应用',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第11节 图像专题',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                ]
            },
            {
              text: '第五章：反应原理大题',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 解题技巧',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            }
          ]
      },
      {
        text: '专题4. 物质结构与性质',
        items:
          [
            {
              text: '第一章：原子结构与性质',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 原子结构',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 元素周期表',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 元素周期律与元素性质',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                ]
            },
            {
              text: '第二章：分子结构与性质',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 共价键',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 分子的空间结构',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 分子结构与性质',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第4节 分子间作用力',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                ]
            },
            {
              text: '第三章：晶体结构与性质',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 晶体基础常识',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 分子晶体与共价晶体',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 金属键与金属晶体',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第4节 离子键与离子晶体',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第5节 晶胞相关计算',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第6节 配合物与超分子',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            }
          ]
      },
      {
        text: '专题5. 化学实验汇总',
        items:
          [
            {
              text: '第一章：基础实验及操作',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 认识常见化学仪器',
                    link: '/5.1.1认识常见化学仪器'
                  },
                  {
                    text: '第2节 物质的分离与提纯',
                    link: '/5.1.2物质的分离与提纯'
                  },
                  {
                    text: '第3节 溶液的配制',
                    link: '/5.1.3溶液的配制'
                  },
                  {
                    text: '第4节 气密性检查',
                    link: '/5.1.4气密性检查'
                  },
                  {
                    text: '第5节 常见物质的检验',
                    link: '/5.1.5常见物质的检验'
                  },
                  {
                    text: '第6节 仪器的洗涤',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第7节 防沸防爆防倒吸',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第8节 事故的处理',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第二章：必修实验',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 卤族元素',
                    link: '/5.2.1卤族元素'
                  },
                  {
                    text: '第2节 氮及其化合物',
                    link: '/5.2.2氮及其化合物'
                  },
                  {
                    text: '第2节 金属元素',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第三章：有机实验',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 烃类',
                    link: '/5.3.1有机实验-烃类'
                  },
                  {
                    text: '第2节 卤代烃',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 醇、酚',
                    link: '/5.3.3有机实验-醇酚'
                  },
                  {
                    text: '第4节 醛、酮',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第5节 羧酸、酯类',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第6节 生物大分子',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第7节 合成高分子',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                ]
            },
            {
              text: '第四章：化学反应原理',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 反应热',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 电化学',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 化学反应速率与平衡',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第4节 溶液中的离子平衡',
                    link: '/5.4.4溶液中的离子平衡'
                  }
                ]
            },
            {
              text: '第五章：实验选择题',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 实验装置与基本操作',
                    link: '/5.5.1实验装置与基本操作'
                  },
                  {
                    text: '第2节 实验设计、现象与评价',
                    link: '/5.5.2实验设计、现象与评价'
                  }
                ]
            },
            {
              text: '第六章：实验大题',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 气体流程型实验',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 物质制备型实验',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 定量测定型实验',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节  探究性型实验',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                  // C:\Users\91371\Desktop\高三\高三题型分类材料2024\高三按照题型分类\2022高考实验题专项\学科网资料20220413112001(10份)
                ]
            },
            {
              text: '第七章：教材实验自查',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 必修一',
                    link: '/5.7.1必修一'
                  },
                  {
                    text: '第2节 必修二',
                    link: '/5.7.2必修二'
                  },
                  {
                    text: '第3节 选择性必修1(化反)',
                    link: '/5.7.3选择性必修一',
                  },
                  {
                    text: '第4节 选择性必修2(物构)',
                    link: '/5.7.4选择性必修二',
                  },
                  {
                    text: '第5节 选择性必修3(有机)',
                    link: '/5.7.5选择性必修三',
                  }
                ]
            }

          ]
      },
      {
        text: '专题6. 物质的制备总结',
        items:
          [
            {
              text: '第一章 气体制备',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 Cl<sub>2</sub>的制备',
                    link: '/6.1.1氯气的制备'
                  },
                  {
                    text: '第2节 SO<sub>2</sub>的制备',
                    link: '/6.1.2二氧化硫的制备'
                  },
                  {
                    text: '第3节 NH<sub>3</sub>的制备',
                    link: '/6.1.3氨气的制备'
                  },
                  {
                    text: '第4节 NO、NO<sub>2</sub>的制备',
                    link: '/6.1.4一氧化氮、二氧化氮的制备'
                  },
                  {
                    text: '第5节 H<sub>2</sub>S的制备',
                    link: '/6.1.5硫化氢的制备'
                  },
                  {
                    text: '第6节 CH<sub>4</sub>的制备',
                    link: '/6.1.6甲烷的制备'
                  },
                  {
                    text: '第7节 C<sub>2</sub>H<sub>4</sub>的制备',
                    link: '/6.1.7乙烯的制备'
                  },
                  {
                    text: '第8节 C<sub>2</sub>H<sub>2</sub>的制备',
                    link: '/6.1.8乙炔的制备'
                  },
                  {
                    text: '第9节 气体制备综合练习',
                    link: '/6.1.9气体的制备综合',
                  }

                ]
            },
            {
              text: '第二章 其它物质制备',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 胶体的制备',
                    link: '/2.1.1氯气的制备'
                  },
                  {
                    text: '第2节 常见金属的冶炼',
                    link: '/2.1.1氯气的制备'
                  },
                  {
                    text: '第3节 氯碱工业',
                    link: '/2.1.1氯气的制备'
                  },
                  {
                    text: '第4节 海水提溴、海水提碘',
                    link: '/2.1.1氯气的制备'
                  },
                  {
                    text: '第5节 侯氏制碱法、联合制减法',
                    link: '/2.1.1氯气的制备'
                  },
                  {
                    text: '第6节 配合物的制备',
                    link: '/2.1.1氯气的制备'
                  },
                ]
            }
          ]
      },
      {
        text: '专题7. 离子反应',
        items:
          [
            {
              text: '第一章：离子方程式',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 复分解型',
                    link: '/7.1.1复分解型'
                  },
                  {
                    text: '第2节 氧化还原型',
                    link: '/7.1.2氧化还原型'
                  },
                  {
                    text: '第3节 竞争型、连续反应型、络合反应',
                    link: '/7.1.3竞争型、连续反应型、络合反应'
                  },
                  {
                    text: '第4节 常见元素离子方程式',
                    link: '/7.1.4常见元素离子方程式'
                  },
                  {
                    text: '第5节 离子方程式必刷题',
                    link: '/7.1.5离子方程式必刷题'
                  }
                ]
            },
            {
              text: '第二章：离子共存',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 普通型',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 条件型',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 题目刷起来！',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第三章：离子的检验',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 离子检验',
                    link: '/7.3.1离子检验'
                  },
                  {
                    text: '第2节 沉淀的洗涤',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            },
            {
              text: '第四章：陌生方程式的书写',
              collapsed: true,
              items:
                [
                  {
                    text: '第1节 陌生化学方程式书写',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第2节 陌生离子方程式书写',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  },
                  {
                    text: '第3节 题目刷起来！',
                    link: '/3.1.1碳碳双键、碳碳叁键'
                  }
                ]
            }

          ]
      },
      {
        text: '专题8. 氧化还原反应',
        items: [
          {
            text: '第一章',
            collapsed: true,
            items: [
              {
                text: '第1节 氧化还原反应有关概念',
                link: '/求微粒数目'
              },
              {
                text: '第2节 氧化还原反应的规律',
                link: '/求微粒数目2'
              },
              {
                text: '第3节 常见的氧化剂和还原剂',
                link: '/求微粒数目2'
              },
              {
                text: '第4节 氧化还原相关计算',
                link: '/求微粒数目2'
              }
            ]
          }
        ]
      },
      {
        text: '专题9. 工艺流程题',
        items: [
          {
            text: '第一章',
            collapsed: true,
            items: [
              {
                text: '第1节 工艺流程概述',
                link: '/求微粒数目5'
              },
              {
                text: '第2节 原料预处理',
                link: '/求微粒数目'
              },
              {
                text: '第3节 pH的调控',
                link: '/求微粒数目2'
              },
              {
                text: '第4节 温度的调控',
                link: '/求微粒数目3'
              },
              {
                text: '第5节 加入氧化剂或还原剂',
                link: '/求微粒数目4'
              },
              {
                text: '第6节 加入沉淀剂',
                link: '/求微粒数目5'
              },
              {
                text: '第7节 分离提纯',
                link: '/求微粒数目5'
              },
              {
                text: '第8节 常见杂质的除杂方法',
                link: '/求微粒数目5'
              },
              {
                text: '第9节 绿色、经济、安全',
                link: '/求微粒数目5'
              },
              {
                text: '第10节 相关计算',
                link: '/求微粒数目5'
              },
              {
                text: '第11节 答题模板',
                link: '/求微粒数目5'
              },
              {
                text: '第12节 (刷)工艺流程选择题',
                link: '/求微粒数目5'
              },
            ]
          }
        ]
      },
      {
        text: '专题10. 阿佛加德罗常数',
        items: [
          {
            text: '第一章',
            collapsed: true,
            items: [
              {
                text: '第1节 求微粒数目',
                link: '/求微粒数目'
              },
              {
                text: '第2节 求化学键数目',
                link: '/求微粒数目2'
              },
              {
                text: '第3节 混合物中某微粒数目',
                link: '/求微粒数目3'
              },
              {
                text: '第4节 求转移电子数',
                link: '/求微粒数目4'
              },
              {
                text: '第5节 常见陷阱',
                link: '/求微粒数目5'
              },
            ]
          }
        ]
      },
      {
        text: '专题11. STSE',
        items: [
          {
            text: '第一章',
            collapsed: true,
            items: [
              {
                text: '第1节 环境污染类型及成因',
                link: '/求微粒数目'
              },
              {
                text: '第2节 材料的组成或性质',
                link: '/求微粒数目2'
              },
              {
                text: '第3节 常见的物质与用途',
                link: '/求微粒数目3'
              },
              {
                text: '第4节 生产生活、医疗健康',
                link: '/求微粒数目4'
              },
              {
                text: '第5节 传统文化高频考点',
                link: '/求微粒数目5'
              },
            ]
          }
        ]
      },
      {
        text: '专题12. 反应机理题',
        items: [
          {
            text: '第一章',
            collapsed: true,
            items: [
              {
                text: '第1节 简单模式',
                link: '/求微粒数目'
              },
              {
                text: '第2节 困难模式',
                link: '/求微粒数目2'
              }
            ]
          }
        ]
      },
      {
        text: '专题13. 元素推断',
        items: [
          {
            text: '第一章',
            collapsed: true,
            items: [
              {
                text: '第1节 常见元素的推断',
                link: '/求微粒数目'
              },
              {
                text: '第2节 通过物质结构推断元素',
                link: '/求微粒数目2'
              }
            ]
          }
        ]
      },
      {
        text: '专题14. 溶液中的离子图像',
        items: [
          {
            text: '第一章 ',
            collapsed: true,
            items: [
              {
                text: '第1节 滴定图像',
                link: '/求微粒数目'
              },
              {
                text: '第2节 分布系数图像',
                link: '/求微粒数目2'
              },
              {
                text: '第3节 沉淀溶解平衡图像',
                link: '/求微粒数目'
              },
              {
                text: '第4节 对数图像',
                link: '/求微粒数目2'
              }
            ]
          }
        ]
      },
      {
        text: '专题15. 反应原理大题',
        items: [
          {
            text: '第一章 化学热力学',
            collapsed: true,
            items: [
              {
                text: '第1节 反应热的计算',
                link: '/求微粒数目'
              },
              {
                text: '第2节 键能的计算',
                link: '/求微粒数目2'
              },
              {
                text: '第3节 化学平衡状态的判断',
                link: '/求微粒数目2'
              },
              {
                text: '第4节 反应的方向与限度',
                link: '/求微粒数目'
              }
            ]
          },
          {
            text: '第二章 化学动力学',
            collapsed: true,
            items: [
              {
                text: '第1节 反应速率',
                link: '/求微粒数目'
              },
              {
                text: '第2节 速率方程和反应级数',
                link: '/求微粒数目2'
              },
              {
                text: '第3节 速率常数和阿伦尼乌斯公式',
                link: '/求微粒数目2'
              },
              {
                text: '第4节 活化能、过渡态、决速步',
                link: '/求微粒数目'
              },
              {
                text: '第5节 催化剂、中间产物',
                link: '/求微粒数目2'
              }
            ]
          },
          {
            text: '第三章 化学平衡',
            collapsed: true,
            items: [
              {
                text: '第1节 化学平衡常数',
                link: '/求微粒数目'
              },
              {
                text: '第2节 压强平衡常数',
                link: '/求微粒数目2'
              },
              {
                text: '第3节 转化率',
                link: '/求微粒数目2'
              },
              {
                text: '第4节 热夏特列原理与平衡的移动',
                link: '/求微粒数目'
              }
            ]
          },
          {
            text: '第四章 分析',
            collapsed: true,
            items: [
              {
                text: '第1节 结合图像的分析',
                link: '/求微粒数目'
              },
              {
                text: '第2节 原因分析',
                link: '/求微粒数目2'
              }
            ]
          }
        ]
      },
      {
        text: '化学工具箱',
        items: [
          {
            text: '第一章',
            collapsed: true,
            items: [
              {
                text: '第1节 方程式大全',
                link: '/16.1.1方程式大全'
              },
              {
                text: '第2节 溶解度相关表格',
                link: '/求微粒数目2'
              }
            ]
          }
        ]
      }
    ],

    socialLinks: [
      { icon: 'github', link: 'https://github.com/vuejs/vitepress' }
    ]
  }
})
